Revit 2027 API
MechanicalUtils.ConnectDuctPlaceholdersAtCross Method
Overload List
Name | Description
ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId) |  Connects a pair of placeholders that can intersect in a Cross connection.
ConnectDuctPlaceholdersAtCross(Document, ElementId, ElementId, ElementId) |  Connects a trio of placeholders that can intersect in a Cross connection.
ConnectDuctPlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) |  Connects a group of placeholders that can intersect in a Cross connection.
Top
See Also
Reference
MechanicalUtils Class
Autodesk.Revit.DB.Mechanical Namespace